#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.aws-cloudfront.aws_cloudfront_distribution.shunblog-org will be destroyed
  - resource "aws_cloudfront_distribution" "shunblog-org" {
      - active_trusted_signers         = {
          - "enabled" = "false"
          - "items.#" = "0"
        } -> null
      - aliases                        = [
          - "shunblog.org",
        ] -> null
      - arn                            = "arn:aws:cloudfront::589845989135:distribution/E15KRPRZWPND12" -> null
      - caller_reference               = "1571904040701" -> null
      - domain_name                    = "d3px2pbdmvukje.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "E2YB3K2G2HB64U" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E15KRPRZWPND12" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = false -> null
      - last_modified_time             = "2019-10-28 06:19:53.269 +0000 UTC" -> null
      - price_class                    = "PriceClass_All" -> null
      - retain_on_delete               = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {} -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "GET",
              - "HEAD",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "S3-shunblog.org" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      - origin {
          - domain_name = "shunblog.org.s3-website-us-east-1.amazonaws.com" -> null
          - origin_id   = "S3-shunblog.org" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "http-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:589845989135:certificate/523ea8e9-ac52-4128-ae5e-a11ad5a000d5" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1.1_2016" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # module.aws-cloudfront.aws_cloudfront_distribution.shunblog-org_distribution will be destroyed
  - resource "aws_cloudfront_distribution" "shunblog-org_distribution" {
      - active_trusted_signers         = {
          - "enabled" = "false"
          - "items.#" = "0"
        } -> null
      - aliases                        = [
          - "shunblog.org",
        ] -> null
      - arn                            = "arn:aws:cloudfront::589845989135:distribution/E15KRPRZWPND12" -> null
      - caller_reference               = "1571904040701" -> null
      - domain_name                    = "d3px2pbdmvukje.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "E2YB3K2G2HB64U" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E15KRPRZWPND12" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = false -> null
      - last_modified_time             = "2019-10-28 06:19:53.269 +0000 UTC" -> null
      - price_class                    = "PriceClass_All" -> null
      - retain_on_delete               = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {} -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "GET",
              - "HEAD",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 86400 -> null
          - max_ttl                = 31536000 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "S3-shunblog.org" -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "redirect-to-https" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }
        }

      - origin {
          - domain_name = "shunblog.org.s3-website-us-east-1.amazonaws.com" -> null
          - origin_id   = "S3-shunblog.org" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "http-only" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1",
                  - "TLSv1.1",
                  - "TLSv1.2",
                ] -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:589845989135:certificate/523ea8e9-ac52-4128-ae5e-a11ad5a000d5" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1.1_2016" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # module.aws-s3-bucket.data.aws_iam_policy_document.s3_policy-shunblog will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3_policy-shunblog"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
            ]

          + principals {
              + identifiers = [
                  + "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOM92BGAT6IKJ",
                ]
              + type        = "AWS"
            }
        }
    }

  # module.aws-s3-bucket.aws_cloudfront_origin_access_identity.origin_access_identity-shunblog will be updated in-place
  ~ resource "aws_cloudfront_origin_access_identity" "origin_access_identity-shunblog" {
        caller_reference                = "1572344901796"
        cloudfront_access_identity_path = "origin-access-identity/cloudfront/EOM92BGAT6IKJ"
      ~ comment                         = "access-identity-www.shunblog.org.s3.amazonaws.com" -> "Some comment"
        etag                            = "E9IXY487XBAC2"
        iam_arn                         = "arn:aws:iam::cloudfront:user/CloudFront Origin Access Identity EOM92BGAT6IKJ"
        id                              = "EOM92BGAT6IKJ"
        s3_canonical_user_id            = "e5d5a1b004b62ec37a425feed983a99e2be97352baa9ae9bf73ac45160de8f58cfe0061b4aa653a4cda2b2ceaaf2fc82"
    }

  # module.aws-s3-bucket.aws_s3_bucket.shunblog-org will be created
  + resource "aws_s3_bucket" "shunblog-org" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "shunblog.org"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.aws-s3-bucket.aws_s3_bucket_policy.shunblog-org must be replaced
-/+ resource "aws_s3_bucket_policy" "shunblog-org" {
      ~ bucket = "EOM92BGAT6IKJ" -> (known after apply) # forces replacement
      ~ id     = "EOM92BGAT6IKJ" -> (known after apply)
      + policy = (known after apply)
    }

Plan: 2 to add, 1 to change, 3 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
